{
  "status": "success",
  "region_info": [
    {
      "id" : 1,
      "map" : "/image/regionmap/1.jpg",
      "region_name" : "kanto",
      "region_description": "Kanto was the first region to be introduced in the game series, featured in the Red, Blue and Yellow games along with the Generation III remakes and the Generation VII remakes. It is also accessible in the latter portion of Pokémon Gold, Silver, and Crystal after defeating the Elite Four.<br/> Like most regions, there is a theme regarding the names of towns and cities in Kanto. Most locations in Kanto are named after a color. The regional Pokémon professor is Professor Oak, who resides in Pallet Town.",
      "settlements" : [
        {
          "eng" : "Pallet Town",
          "jap" : "マサラタウン",
          "slogan" : "A Pure White Beginning"
        },
        {
          "eng" : "Viridian City",
          "jap" : "ハナダシティ",
          "slogan" : "The City of Evergreen"
        },
        {
          "eng" : "Pewter City",
          "jap" : "ニビシティ",
          "slogan" : "Between Rugged Mountains"
        },
        {
          "eng" : "Cerulean City",
          "jap" : "ハナダシティ",
          "slogan" : "The Floral Lagoon City"
        },
        {
          "eng" : "Vermilion City",
          "jap" : "クチバシティ",
          "slogan" : "The Port of Exquisite Sunsets"
        },
        {
          "eng" : "Lavender Town",
          "jap" : "シオンタウン",
          "slogan" : "The Noble Town"
        },
        {
          "eng" : "Celadon City",
          "jap" : "タマムシシティ",
          "slogan" : "City of the Rainbow's Colors"
        },
        {
          "eng" : "Fuchsia City",
          "jap" : "セキチクシティ",
          "slogan" : "Happening and Passing City"
        },
        {
          "eng" : "Saffron City",
          "jap" : "ヤマブキシティ",
          "slogan" : "Shining Big City"
        },
        {
          "eng" : "Cinnabar Island",
          "jap" : "グレンタウン",
          "slogan" : "The Ravaged Town of the Past"
        },
        {
          "eng" : "Indigo Plateau",
          "jap" : "セキエイこうげん",
          "slogan" : "The ultimate Goal of Trainers!"
        }
      ],
      "info-from" : "https://pokemon.fandom.com/wiki/Kanto"
    },
    {
      "id" : 2,
      "map" : "/image/regionmap/2.jpg",
      "region_name" : "johto",
      "region_description": "Johto is the second region introduced in the main game series, being featured in the Gold, Silver and Crystal games along with the Generation IV remakes. Geographically, Johto is located to the west of the Kanto region. <br/>The theme for locations in the Johto region is either plants or something related to a plant. The regional Pokémon professor is Professor Elm, who resides in New Bark Town.",
      "info-from" :"https://pokemon.fandom.com/wiki/Johto"
    },
    {
      "id" : 3,
      "map" : "/image/regionmap/3.jpg",
      "region_name" : "hoenn",
      "region_description": "Hoenn is the featured region in the Generation III games, Pokémon Ruby, Sapphire and Emerald. Geographically, Hoenn is located to the southwest of Kanto and Johto.<br>The theme for the locations in the Hoenn region is that of two words used together. The regional Pokémon professor is Professor Birch, who resides in Littleroot Town.",
      "info-from" :"https://pokemon.fandom.com/wiki/Hoenn"
    },
    {
      "id" : 4,
      "map" : "/image/regionmap/4.jpg",
      "region_name" : "sinnoh",
      "region_description": "Sinnoh is the region featured in the Generation IV games Pokémon Diamond, Pearl and Platinum. Sinnoh is located to the north of the Kanto region.<br>Unlike other regions, there is no theme underlying the names of locations in Sinnoh. The regional Pokémon professor is Professor Rowan, who resides in Sandgem Town, being the first professor to live in a town that is not the player's starting location.",
      "info-from" :"https://pokemon.fandom.com/wiki/Sinnoh"
    },
    {
      "id" : 5,
      "map" : "/image/regionmap/5.jpg",
      "region_name" : "unova",
      "region_description": "Unova is the region featured in the Generation V games Pokémon Black and White. It is said that Unova is located very far away from the other regions, needing a boat to get there.<br>The theme for the names of Unova locations is weather, specifically clouds, since a few of the places seem to be named after types of clouds. (Nimbasa = Nimbus, Icirrus = Cirrus, for example) The regional Pokémon professor is Professor Juniper, who is the first regional professor to be female. She resides in Nuvema Town.",
      "info-from" :"https://pokemon.fandom.com/wiki/Unova"
    },
    {
      "id" : 6,
      "map" : "/image/regionmap/6.jpg",
      "region_name" : "kalos",
      "region_description": "Kalos is the sixth region that appeared in Generation VI's game Pokémon X and Y. It is based off France. The regional scientist is Professor Sycamore, living in Lumiose City.",
      "info-from" :"https://pokemon.fandom.com/wiki/Kalos"
    },
    {
      "id" : 7,
      "map" : "/image/regionmap/7.jpg",
      "region_name" : "alola",
      "region_description": "Alola is the region where Pokémon Sun and Moon and Pokemon Ultra Sun and Ultra Moon take place.<br>Among the starter Pokémon for beginners are Rowlet, the Grass-type Pokémon, Litten, the Fire-type Pokémon, and Popplio, a Water-type Pokémon. In the anime, it is the residence of Lana, Mallow, Sophocles, Kiawe, Professor Kukui and Lillie.",
      "info-from" :"https://pokemon.fandom.com/wiki/Alola"
    },
    {
      "id" : 8,
      "map" : "/image/regionmap/8.jpg",
      "region_name" : "galar",
      "region_description": "Galar is the eighth region that appeared in Generation VIII's game Pokémon Sword and Shield. It is based off the United Kingdom.<br>Galar is the region where Pokémon Sword and Shield takes place. It debuted in Pokémon Journeys: The Series. The Starter Pokémon for beginners are Grookey, Scorbunny, and Sobble.",
      "info-from" :""
    }
  ]
}
